#pragma once
#include "RandDataCreator.h"

std::vector<std::string> CreateRand::ManNames{
	"юбдеи", "юбйяемрхи", "юцютнм", "юйюйхи", "юкейяюмдп", "юкейяеи", "юкэаепр", "юмюрнкхи", "юмдпеи", "юмрнм", "юмрнмхм", "юмтхл", "юпхярюпу",
	"юпйюдхи", "юпяемхи", "юпр╗л", "юпрелхи", "юпрсп", "юпухоо", "ютюмюяхи", "анцдюм", "анпхя", "бюбхкю", "бюдхл", "бюкемрхм", "бюкепхи", "бюкепэъм",
	"бюпкюл", "бюпянмнтхи", "бюптнкнлеи", "бюяхкхи", "бемедхйр", "бемхюлхм", "бхйемрхи", "бхйрнп", "бхяяюпхнм", "бхрюкхи", "бкюдхлхп", "бкюдхякюб",
	"бкюдкем", "бкюя", "бяебнкнд", "бъвеякюб", "цюбпххк", "цюкюйрхнм", "цекюяхи", "цеммюдхи", "ценпцхи", "цепюяхл", "цеплюм", "цеплюмм", "цкеа",
	"цнпдеи", "цпхцнпхи", "дюмюйр", "дюмххк", "делхд", "делэъм", "демхя", "длхрпхи", "днапшмъ", "днмюр", "днпнтеи", "ебцемхи", "ебцпют", "ебднйхл",
	"ебяеи", "ебярютхи", "ецнп", "елекэъм", "епелеи", "еплнкюи", "епнтеи", "етхл", "етпел", "фдюм", "гхмнбхи", "хюйхмт", "хбюм", "хцмюрхи", "хцнпэ",
	"хгнр", "хкэъ", "хммнйемрхи", "хпюйкхи", "хпхмеи", "хяююй", "хяхднп", "хсдю", "хскхюм", "йюохрнм", "йхл", "йхп", "йхпхкк", "йкхлемр", "йнмдпюр",
	"йнмнм", "йнмярюмрхм", "йнпмхкхи", "йсгэлю", "йсопхъм", "кюбпемрхи", "кеб", "кенмхд", "кенмрхи", "кнццхм", "ксйю", "ксйхи", "ксйэъм", "люцхярпхюм",
	"люйюп", "люйяхл", "люлнмр", "люпй", "люпршм", "люрбеи", "лекемрхи", "лхмю", "лхпнякюб", "лхрпнтюм", "лхуюхк", "лярхякюб", "мюгюп", "меярнп",
	"мхйюмдп", "мхйюмнп", "мхйхрю", "мхйхтнп", "мхйндхл", "мхйнкюи", "мхйнм", "нкец", "нмхяхл", "нмстпхи", "оюбек", "оюхяхи", "оюмйпюрхи", "оюмрекеилнм",
	"оюптемхи", "оютмсрхи", "оюунлхи", "о╗рп", "окюрнм", "онкхйюпо", "онптхпхи", "онрюо", "опнб", "опнйнохи", "опнрюяхи", "опнунп", "пюгслмхй", "пндхнм",
	"пнднякюб", "пнлюм", "пнярхякюб", "псякюм", "яюббю", "яюбекхи", "яюлсхк", "ябърнонкй", "ябърнякюб", "яебюярэъм", "яел╗м", "яепютхл", "яепцеи",
	"яхкю", "яхкэбеярп", "янгнм", "янтпнм", "яохпхднм", "ярюмхякюб", "яреоюм", "рюпюя", "рхлнтеи", "рхлсп", "рхр", "рхунм", "рпхтнм", "рпнтхл", "спаюм",
	"тюддеи", "т╗днп", "тедняеи", "теднр", "текхйя", "тенйрхяр", "тхкюр", "тхкхлнм", "тхкхоо", "тхпя", "тнйю", "тнлю", "тнрхи", "тпнк", "уюпхрнм",
	"упхяюмт", "упхярнтнп", "щдсюпд", "щпюяр", "чкхюм", "чпхи", "чярхм", "ъйнб", "ъйсм", "ъпнякюб"
};
std::vector<std::string> CreateRand::ManSurnames{
	"ялхпмнб", "хбюмнб", "йсгмежнб", "янйнкнб", "ононб", "кеаедеб", "йнгкнб", "мнбхйнб", "лнпнгнб", "оерпнб", "бнкйнб", "янкнбэ╗б", "бюяхкэеб", "гюижеб",
	"оюбкнб", "яел╗мнб", "цнксаеб", "бхмнцпюднб", "анцдюмнб", "бнпнаэ╗б", "т╗днпнб", "лхуюикнб", "аекъеб", "рюпюянб", "аекнб", "йнлюпнб", "нпкнб", "йхяек╗б",
	"люйюпнб", "юмдпееб", "йнбюк╗б", "хкэхм", "цсяеб", "рхрнб", "йсгэлхм", "йсдпъбжеб", "аюпюмнб", "йскхйнб", "юкейяееб", "яреоюмнб", "ъйнбкеб", "янпнйхм",
	"яепцееб", "пнлюмнб", "гюуюпнб", "анпхянб", "йнпнк╗б", "цепюяхлнб", "онмнлюп╗б", "цпхцнпэеб", "кюгюпеб", "ледбедеб", "епьнб", "мхйхрхм", "янанкеб",
	"пъанб", "онкъйнб", "жберйнб", "дюмхкнб", "фсйнб", "тпнкнб", "фспюбк╗б", "мхйнкюеб", "йпшкнб", "люйяхлнб", "яхднпнб", "няхонб", "аекнсянб", "теднрнб",
	"днпнтееб", "ецнпнб", "люрбееб", "анапнб", "длхрпхеб", "йюкхмхм", "юмхяхлнб", "оерсунб", "юмрнмнб", "рхлнтееб", "мхйхтнпнб", "беяекнб", "тхкхоонб",
	"люпйнб", "анкэьюйнб", "ясуюмнб", "лхпнмнб", "ьхпъеб", "юкейяюмдпнб", "йнмнбюкнб", "ьеярюйнб", "йюгюйнб", "етхлнб", "демхянб", "цпнлнб", "тнлхм",
	"дюбшднб", "лекэмхйнб", "ыепаюйнб", "акхмнб", "йнкеямхйнб", "йюпонб", "ютюмюяэеб", "бкюянб", "люякнб", "хяюйнб", "рхунмнб", "юйя╗мнб", "цюбпхкнб",
	"пндхнмнб", "йнрнб", "цнпасмнб", "йсдпъьнб", "ашйнб", "гсеб", "рперэъйнб", "яюбекэеб", "оюмнб", "пшаюйнб", "ясбнпнб", "юапюлнб", "бнпнмнб", "лсухм",
	"юпухонб", "рпнтхлнб", "люпршмнб", "елекэъмнб", "цнпьйнб", "вепмнб", "нбвхммхйнб", "яекегм╗б", "оюмтхкнб", "йношкнб", "лхуееб", "цюкйхм", "мюгюпнб",
	"кнаюмнб", "ксйхм", "аекъйнб", "онрюонб", "мейпюянб", "унукнб", "фдюмнб", "мюслнб", "ьхкнб", "бнпнмжнб", "еплюйнб", "дпнгднб", "хцмюрэеб", "яюбхм",
	"кнцхмнб", "яютнмнб", "йюосярхм", "йхпхккнб", "лнхяееб", "екхяееб", "йньекеб", "йнярхм", "цнпаюв╗б", "нпеунб", "етпелнб", "хяюеб", "ебднйхлнб", "йюкюьмхйнб",
	"йюаюмнб", "мняйнб", "чдхм", "йскюцхм", "кюохм", "опнунпнб", "меярепнб", "уюпхрнмнб", "юцютнмнб", "лспюбэ╗б", "кюпхнмнб", "тедняееб", "гхлхм", "оюунлнб",
	"ьсахм", "хцмюрнб", "тхкюрнб", "йпчйнб", "пнцнб", "йскюйнб", "репемрэеб", "лнквюмнб", "бкюдхлхпнб", "юпрелэеб", "цспэеб", "гхмнбэеб", "цпхьхм", "йнмнмнб",
	"делемрэеб", "яхрмхйнб", "яхлнмнб", "лхьхм", "тюдееб", "йнлхяяюпнб", "люлнмрнб", "мнянб", "цскъеб", "ьюпнб", "сярхмнб", "бхьмъйнб", "ебяееб", "кюбпемрэеб",
	"апюцхм", "йнмярюмрхмнб", "йнпмхкнб", "юбдееб", "гшйнб", "ахпчйнб", "ьюпюонб", "мхйнмнб", "ысйхм", "дэъвйнб", "ндхмжнб", "яюгнмнб", "ъйсьеб", "йпюяхкэмхйнб",
	"цнпдееб", "яюлникнб", "ймъгеб", "аеяоюкнб", "сбюпнб", "ьюьйнб", "анашк╗б", "днпнмхм", "аекнг╗пнб", "пнфйнб", "яюлянмнб", "лъямхйнб", "кхуюв╗б", "аспнб",
	"яшянеб", "тнлхв╗б", "псяюйнб", "ярпекйнб", "цсыхм", "ререпхм", "йнкнанб", "ясаанрхм", "тнйхм", "акнухм", "яекхбепярнб", "оеярнб", "йнмдпюрэеб", "яхкхм",
	"лепйсьеб", "кшрйхм", "рспнб"
};
std::vector<std::string> CreateRand::ManPatron{
	"юаюйслнбхв", "юапюлнбхв", "юапняхлнбхв", "юббюйслнбхв", "юбцсярнбхв", "юбдеебхв", "юбдхебхв", "юбемхпнбхв", "юбепхебхв", "юбепйхебхв", "юбепэъмнбхв",
	"юбпюлнбхв", "юцюонбхв", "юцютнмнбхв", "юццеебхв", "юдюлнбхв", "юдпхюмнбхв", "югюпнбхв", "юйхлнбхв", "юйхмтнбхв", "юйя╗мнбхв", "юкейяюмдпнбхв",
	"юкейяеебхв", "юкэаепрнбхв", "юкэтпеднбхв", "юлнянбхв", "юмдпеебхв", "юмдпхюмнбхв", "юмдпнмнбхв", "юмдпнмхйнбхв", "юмхйеебхв", "юмхйхебхв", "юмхяхлнбхв",
	"юмрхонбхв", "юмрнмнбхв", "юмрнмхмнбхв", "юмрпнонбхв", "юмстпхебхв", "юпдюкхнмнбхв", "юпдюкэнмнбхв", "юпетнбхв", "юпхярюпунбхв", "юпмнкэднбхв", "юпнмнбхв",
	"юпрюлнмнбхв", "юпр╗лнбхв", "юпрспнбхв", "юпухонбхв", "юяйнкэднбхв", "ютхмнцемнбхв", "аемедхйрнбхв", "анцдюмнбхв", "анмхтюрнбхв", "анпхянбхв", "бюдхлнбхв",
	"бюкемрхмнбхв", "бюкепхюмнбхв", "бюкепэъмнбхв", "бюпкюлнбхв", "бюпянмнтнбхв", "бюптнкнлеебхв", "бюяхкэебхв", "бекхлхпнбхв", "бемедхйрнбхв", "бемхюлхмнбхв",
	"бемэълхмнбхв", "бхйрнпнбхв", "бхйрнпхебхв", "бхйрнпхмнбхв", "бхйскнбхв", "бхйскхв", "бхкемнбхв", "бхкемхмнбхв", "бхкэцекэлнбхв", "бхяяюпхнмнбхв", "бхрнкэднбхв",
	"бкюдхкемнбхв", "бкюдхлхпнбхв", "бкюдкемнбхв", "бкюянбхв", "бнмхтюрнбхв", "бяебнкнднбхв", "бсйнкнбхв", "цюбпххкнбхв", "цюкюйрхнмнбхв", "цекхебхв", "цемпхунбхв",
	"ценпцхебхв", "цепюяхлнбхв", "цеплюмнбхв", "цеплнцемнбхв", "цкеанбхв", "цнпдеебхв", "цпхцнпэебхв", "дюбхднбхв", "дюбшднбхв", "дюмххкнбхв", "делхднбхв",
	"делэъмнбхв", "демхянбхв", "дхлхрпхебхв", "дхнлхднбхв", "дхнмхяхебхв", "длхрпхебхв", "днмюрнбхв", "днпхледнмрнбхв", "днпледнмрнбхв", "днплхднмрнбхв",
	"днпнтеебхв", "ебцпютнбхв", "ебцпютэебхв", "ебднйхлнбхв", "еблемнбхв", "ебяеебхв", "ебярхцмеебхв", "ебярпюрнбхв", "ецнпнбхв", "екхгюпнбхв", "екхяеебхв",
	"екхярпюрнбхв", "елекэъмнбхв", "еохтюмнбхв", "епелеебхв", "еплхкнбхв", "еплхкхв", "еплхкэебхв", "еплнкюебхв", "епнтеебхв", "етхлнбхв", "етпелнбхв",
	"гюуюпнбхв", "гемнмнбхв", "гняхлнбхв", "гняхлхв", "хюйхлнбхв", "хюйхмтнбхв", "хбюмнбхв", "хцмюрнбхв", "хцнпебхв", "хгняхлнбхв", "хгнрнбхв", "хкюпхнмнбхв",
	"хкхнднпнбхв", "хкэхв", "хнюммнбхв", "хнмхв", "хняхтнбхв", "хоюрнбхв", "хоонкхрнбхв", "хяююйнбхв", "хяююйхебхв", "хяюебхв", "хяюйнбхв", "хяюйхебхв",
	"хяхднпнбхв", "хсярхмнбхв", "йюгхлхпнбхв", "йюккхмхйнбхв", "йюккхярпюрнбхв", "йюохрнмнбхв", "йюпкнбхв", "йюпонбхв", "йюяэъмнбхв", "йхлнбхв", "йхопхюмнбхв",
	"йхпхюйнбхв", "йхпяюмнбхв", "йкюбдхебхв", "йкхлнбхв", "йкхлемрнбхв", "йнмдпюрнбхв", "йнмдпюрэебхв", "йнмнмнбхв", "йнмярюмрхмнбхв", "йнпмеебхв",
	"йнпмхкнбхв", "йяемнтнмрнбхв", "йсгэлхв", "йсопхъмнбхв", "кюбпнбхв", "кюгюпебхв", "кюпхнмнбхв", "кэбнбхв", "кенмнбхв", "кенмюпднбхв", "кенмхднбхв",
	"кенонкэднбхв", "кнцбхмнбхв", "ксйхв", "ксйэъмнбхв", "люебхв", "люйюпнбхв", "люйяхлнбхв", "люйяхлхюмнбхв", "люйяхлхкхюмнбхв", "люйяхлхкэъмнбхв", "люмсхкнбхв",
	"люпйнбхв", "люпйекнбхв", "люпкемнбхв", "люпрхлэъмнбхв", "люпрхмнбхв", "люпрхмхюмнбхв", "люпршмнбхв", "люпрэъмнбхв", "люрбеебхв", "лепйскнбхв", "лхкхебхв",
	"лхмхв", "лхмюебхв", "лхпнмнбхв", "лхрпнтюмнбхв", "лхуеебхв", "лндеярнбхв", "лнхяеебхв", "лнйеебхв", "лнйхебхв", "мюгюпнбхв", "мюпйхянбхв", "мюслнбхв",
	"меярепнбхв", "меярнпнбхв", "мет╗днбхв", "мхйюмдпнбхв", "мхйюмнпнбхв", "мхйхрхв", "мхйхтнпнбхв", "мхйндхлнбхв", "мхйнкюебхв", "мхйнмнбхв", "мхкнбхв",
	"мхтнмрнбхв", "нкецнбхв", "нкхлохебхв", "нмхяхлнбхв", "нмстпхебхв", "нпеярнбхв", "няхонбхв", "няйюпнбхв", "нярюонбхв", "оюбкнбхв", "оюбкхмнбхв",
	"оюлтхкнбхв", "оюлтхкэебхв", "оюмйпюрнбхв", "оюмрекеебхв", "оюмрекеилнмнбхв", "оюмтхкнбхв", "оюпюлнмнбхв", "оюплемнбхв", "оюпл╗мнбхв", "оюпт╗мнбхв",
	"оюптемрэебхв", "оюрпхйеебхв", "оюрпхйхебхв", "оюунлнбхв", "оерпнбхв", "охлемнбхв", "окюрнмнбхв", "онкхебйрнбхв", "онкхейрнбхв", "онкхйюпонбхв",
	"онптхпнбхв", "онрюонбхв", "опнбхв", "опнйкнбхв", "опнйнонбхв", "опнйнтэебхв", "опнрюянбхв", "опнунпнбхв", "пюдхебхв", "пютюхкнбхв", "пнаепрнбхв",
	"пндхнмнбхв", "пнлюмнбхв", "псднкэтнбхв", "пчпхйнбхв", "яюббхв", "яюббюреебхв", "яюб╗кнбхв", "яюлникнбхв", "яюлянмнбхв", "яюлсхкнбхв", "яебюярэъмнбхв",
	"яебепэъмнбхв", "яекхбюмнбхв", "яекхб╗пярнбхв", "яекхтюмнбхв", "яел╗мнбхв", "яепютхлнбхв", "яепцеебхв", "яхднпнбхв", "яхкэбеярпнбхв", "яхлнмнбхв",
	"янгнмнбхв", "янгнмрнбхв", "янгнмрэебхв", "янкнлнмнбхв", "янтнмнбхв", "янтпнмнбхв", "яохпхднмнбхв", "яреоюмнбхв", "яшянебхв", "рюпюянбхв", "рхлнтеебхв",
	"рхлспнбхв", "рхрнбхв", "рхунмнбхв", "рпхтнмнбхв", "рпнтхлнбхв", "скэъмнбхв", "сярхмнбхв", "тюдеебхв", "т╗днпнбхв", "теднянбхв", "тедняеебхв", "теднрнбхв",
	"текхйянбхв", "тенйрхярнбхв", "тентюмнбхв", "тентхкнбхв", "тентхкюйрнбхв", "тепюонмрнбхв", "тхкюпернбхв", "тхкюрнбхв", "тхкхлнмнбхв", "тхкхоэебхв",
	"тхкхоонбхв", "тхпянбхв", "ткецнмрнбхв", "тнйхв", "тнлхв", "тпхдпхунбхв", "тпнкнбхв", "уюпхрнмнбхв", "уюпкюлнбхв", "уюпкюлонбхв", "упхяюмтнбхв",
	"упхярнтнпнбхв", "щдсюпднбхв", "щллюмсхкнбхв", "щпмеярнбхв", "чкхюмнбхв", "чпэебхв", "ъйхлнбхв", "ъйнбкебхв"
};
std::vector<std::string> CreateRand::Colors {
	"яепеапхярн - яберкн нпюмфебши", "яепеапхярн - в╗пмши", "аекюъ дбсуякнимюъ", "ъпйн - ф╗крши", "яепеапхярши яхме - гек╗мши",
	"яепеапхярн - йнпхвмебши", "нкхбйнбн - гек╗мши", "аекши лерюккхй", "яепеапхярши яберкн - яепши", "ъпйн - гек╗мши",
	"яепеапхярши тхнкернбши", "яепеапхярн - р╗лмн - гек╗мши", "цнксани", "р╗лмн - бхьм╗бши", "яепеапхярн - аефебши",
	"яепеапхярши нпюмфебши", "яепеапхярн - гек╗мши", "р╗лмн - яхме - гек╗мши", "яберкн - яхмхи", "(GM)яберкн - яепши",
	"яепеапхярн - гек╗мн - цнксани", "аефебши", "яепн - в╗пмши", "р╗лмн - тхнкернбши", "р╗лмн - яхме - гек╗мши", "гек╗мши",
	"аефебши", "аефебши", "аекши", "аекши", "яепеапхярн - гек╗мши", "яепеапхярн - р╗лмн яепши", "яепеапхярн - яепн - яхмхи",
	"гек╗мн - цнксани", "аефебн - йнпхвмебши", "йпюямши лерюккхй", "лерюккхй яепн - аефебши", "яепн - тхнкернбши", "яепн - гек╗мши",
	"р╗лмн - йпюямши", "р╗лмн - яепши", "яепеапхярши ъпйн - йпюямши", "р╗лмн - яепеапхярн - йпюямши", "р╗лмн - анпднбши",
	"яепн - гек╗мши", "р╗лмн - тхнкернбши", "яепн - цнксани", "цнксани", "р╗лмн - анпднбши", "яепн - яхмхи", "яепеапхярн - яепн - йнпхвмебши",
	"нпюмфебн - йнпхвмебши", "яхмхи", "яепеапхярн - ф╗крши", "яепеапхярн - лнкнвмн - гек╗мши", "аекн - ф╗крши", "ъпйн - ф╗крши",
	"яепеапхярн - аекн - лнкнвмши", "яепн - яхмхи", "гек╗мши", "аефебн - яхпемебши", "р╗лмн - гек╗мши", "гек╗мши", "р╗лмн - гек╗мши",
	"аефебн - гнкнрхярши", "гнкнрхярши р╗лмн - гек╗мши", "яепеапхярн - ф╗крн - гек╗мши", "гнкнрхярн - аефебши",
	"гнкнрхярши р╗лмн - гек╗мши", "яепеапхярн - ъпйн - гек╗мши", "р╗лмн - тхкернбши", "яепеапхярн - гек╗мши", "р╗лмн - яхмхи", "тхнкернбши",
	"йпюямши", "р╗лмн - бхьм╗бши", "р╗лмн - гек╗мши", "ъпйн - йпюямши", "гнкнрхярн - йпюямши", "р╗лмн - яхме - гек╗мши",
	"яберкши яепн - аефебши", "ъпйн - йпюямши", "йпюямши", "р╗лмн - яепши", "яепн - гек╗мши", "р╗лмн - гек╗мши", "гнкнрхярн - нкхбйнбши",
	"яепеапхярши р╗лмн - йпюямши", "гнкнрхярн - йнпхвмебши", "йнпхвмебши", "яепеапхярши анкнрмн - гек╗мши", "в╗пмши", "яепеапхярн - бхьм╗бши",
	"бхьм╗бши", "яберкн - яепши", "йпюямши", "яепеапхярн - тхнкернбши", "яепеапхярн - йнпхвмебши", "яепеапхярн - яхмхи", "яепеапхярн - цнксани",
	"тхнкернбн - яхмхи", "яепеапхярши р╗лмн - яхмхи", "яхмхи", "гек╗мши", "аекши", "цнксани", "яберкн - цнксани", "р╗лмн - яхмхи",
	"яепеапхярн - ъпйн - тхнкернбши", "нпюмфебши", "яепеапхярши р╗лмн - анпднбши", "йпюямши лерюккхй", "цнксани", "фекрн - гнкнрни",
	"гек╗мши", "яепеапхярн - р╗лмн - яхмхи", "яепеапхярн - аефебн - пнгнбши", "яепеапхярши - фекрн - гек╗мши", "яепеапхярн - яепн - цпютхрнбши",
	"яепеапхярши ярюкэмни", "ъпйн - яхмхи", "р╗лмн - гек╗мши", "ъпйн - тхнкернбши", "яхме - гек╗мши", "лсяйюпх", "яепеапхярн - яепн - гнкнрхярши",
	"ф╗крши", "р╗лмн - гек╗мши", "яепеапхярн - яепн - аефебши", "яепеапхярн - р╗лмн - яепн - яхмхи", "р╗лмн - гек╗мши", "яепеапхярши - аефебши",
	"яепеапхярн - яепн - цнксанбюрши", "яхме - гек╗мши", "яепн - яхмхи", "р╗лмн - яепн - гек╗мши", "р╗лмн - яхмхи", "гнкнрхярн - гек╗мши",
	"фекрн - гек╗мши", "ъпйн - яхмхи", "яепеапхярн - цнксанбюрши", "япедме - ярюкэмни", "яепеапхярн - аефебши", "гекемн - цнксани",
	"яепеапхярн - яепн - гекемнбюрши", "яепеапхярн - йпюямн - нпюмфебши", "р╗лмн - яхмхи", "яепн - гекемнбюрши", "йпюямн - йнпхвмебши",
	"гекемн - яхмхи", "яепеапхярн - аефебши", "яепн - йнпхвмебши", "р╗лмн - бхьм╗бши лерюккхй", "р╗лмн - яхмхи", "ъпйн - ф╗крши",
	"яепеапхярн - яепн - гек╗мши", "яепеапхярн - р╗лмн - яхмхи", "яепеапхярн - аефебши", "яберкн - ф╗крши", "яепеапхярн - ъпйн - яхмхи",
	"яепеапхярн - р╗лмн - яхмхи", "ъпйн - йпюямши", "яхме - тхнкернбши", "яепеапхярн - акедмн - яепши", "р╗лмн - йнпхвмебши",
	"р╗лмн - гек╗мши", "р╗лмн - йпюямши", "йпюямши", "р╗лмн - цнксани", "яюкюрнбши", "ъпйн - яхмхи", "аефебн - йпюямши",
	"яепеапхярши яхме - тхнкернбши", "яберкн - аефебши", "яберкн - яепши", "яепеапхярши - гекемнбюрн - яепши", "яепеапхярши", "яепн - аефебши",
	"яепн - аекши", "яепн - цнксани", "яепн - гек╗мши", "яепши яепеапхярши", "яепн - аефебши", "р╗лмн - яхмхи", "яхмхи", "яберкн - тхнкернбши",
	"яепн - яхмхи", "яепеапхярн - ъпйн - яхмхи", "якхбнвмн - аекши", "аефебн - ф╗крши", "яепеапхярши", "ямефмн - аекши", "яепеапхярн - яепши",
	"р╗лмн йнпхвмебши", "яепеапхярн - яепн - гекемнбюрши", "яепеапхярши йнпхвмебн - гек╗мши", "яберкн - яепши", "р╗лмн - аефебши",
	"р╗лмн - йнпхвмебши", "р╗лмн - яепши", "р╗лмн - яхмхи", "нрремнй р╗лмн - яхмецн", "яепши", "йпюямши", "яепеапхярн - йпюямши",
	"яепеапхярн - гекемнбюрши", "яхме - гек╗мши", "нпюмфебши", "ъпйн - йпюямши", "в╗пмши", "яепеапхярн - яхпемебши", "р╗лмн - бхьм╗бн - люкхмнбши",
	"жбер лнпяйни бнкмш", "р╗лмн - гек╗мши", "яберкн - ф╗крши", "яепеапхярши р╗лмн - тхнкернбши", "р╗лмн - юкши", "в╗пмши, дбнимюъ щлюкэ",
	"р╗лмн - яхмхи", "в╗пмши", "нрремнй в╗пмнцн", "яепеапхярн - йнпхвмебши", "в╗пмши", "р╗лмн - йнпхвмебши", "р╗лмн - яепши", "яепн - аефебши",
	"яепеапхярн - цнксанбюрши", "р╗лмн - бхьм╗бши"
};
std::vector<std::string> CreateRand::AVEKMNORSTUH{ "ю","б","е","й","л","м","н","п","я","р","с","у" };
std::vector<std::string> CreateRand::Brands{ "MAZDA RX7", "TOYOTA SUPRA", "HONDA CIVIC", "NISSAN 180SX", "NISSAN SKYLINE R34 GTR",
"MAZDA MX5 MIATA", "TOYOTA AE86 HACHIROKU", "ACURA NSX MODEX 90TH", "MITSUBISHI LANCER", "NISSAN 370Z", "TOYOTA SELICA 6 GT4" };
std::vector<std::string> CreateRand::Street{ "кчрхйнб", "пебнкчжхх", "кемхмю", "бняярюмхъ", "жемрпюкэмюъ" ,"лнкнд╗фмюъ"
"ьйнкэмюъ","янберяйюъ","яюднбюъ","кеямюъ","опнкерюпяйюъ","пюанвюъ","лхпю","мюаепефмюъ","гек╗мюъ","гюпевмюъ","цюцюпхмю" };
std::vector<std::string> CreateRand::City{ "яюмйр-оерепаспц","лняйбю","бнкцнцпюд","рчлемэ","янвх","мнбцнпнд" };

std::string CreateRand::DriversNumber() {
	std::string number;
	for (size_t i = 0; i < 2; i++) number += _s(rand() % 10);
	number += ' ';
	for (size_t i = 0; i < 2; i++) number += AVEKMNORSTUH[rand() % AVEKMNORSTUH.size()];
	number += ' ';
	for (size_t i = 0; i < 6; i++) number += _s(rand() % 10);
	return number;
}

std::string CreateRand::Name() {
	return CreateRand::ManSurnames[rand() % ManSurnames.size()] + " " +
		CreateRand::ManNames[rand() % ManNames.size()] + " " +
		CreateRand::ManPatron[rand() % ManPatron.size()];
}

std::string CreateRand::PassportData()
{
	std::string number;
	for (int i = 0; i < 10; i++)
	{
		if (i == 4) number += '-';
		number += _s(rand() % 10);
	}
	return number;
}

std::string CreateRand::Address() {
	return City[rand() % City.size()] + " ск. " + Street[rand() % Street.size()] + " д. " + std::to_string(1 + rand() % 199);
}

uint16_t    CreateRand::Year(uint16_t down, uint16_t up)
{
	return down + rand() % std::abs(up - down);
}

std::string CreateRand::Brand() {
	return Brands[rand() % Brands.size()];
}

std::string CreateRand::AutoNumber() {
	std::string number = AVEKMNORSTUH[rand() % AVEKMNORSTUH.size()];
	for (size_t i = 0; i < 3; i++) number += _s(rand() % 10);
	for (size_t i = 0; i < 2; i++) number += AVEKMNORSTUH[rand() % AVEKMNORSTUH.size()];
	number += '-';
	for (size_t i = 0; i < 2; i++) number += _s(rand() % 10);
	return number;
}

std::string CreateRand::Color() {
	return Colors[rand() % Colors.size()];
}

std::string CreateRand::Date() {
	std::string d, m, y;
	d = _s(1 + rand() % 31);
	m = _s(1 + rand() % 12);
	y = _s(2020 + rand() % 4);
	if (d.size() == 1) d = "0" + d;
	if (m.size() == 1) m = "0" + m;
	return d + "/" + m + "/" + y;
}

Client* RandDataCreator::CreateDriver() {
	Client* Driver = new Client();
	Driver->DriversNumber = CreateRand::DriversNumber();
	Driver->Name = CreateRand::Name();
	Driver->PassportData = CreateRand::PassportData();
	Driver->Address = CreateRand::Address();
	return Driver;
}

Auto* RandDataCreator::CreateCar() {
	Auto* Car = new Auto();
	Car->Brand = CreateRand::Brand();
	Car->AutoNumber = CreateRand::AutoNumber();
	Car->Color = CreateRand::Color();
	Car->ReleaseYear = CreateRand::Year(1990, 2000);
	Car->inStock = true;
	return Car;
}

Event* RandDataCreator::CreateTrade(std::string DriversNumber, std::string AutoNumber) {
	Event* Trade = new Event();
	Trade->Act = Event::EVENT::RENTAL;
	Trade->AutoNumber = AutoNumber;
	Trade->DriversNumber = DriversNumber;
	while (true) {
		Trade->BeginDate = CreateRand::Date();
		Trade->EndDate = CreateRand::Date();
		if (!_Check::DateIsReal(Trade->BeginDate)) continue;
		if (!_Check::DateIsReal(Trade->EndDate)) continue;
		if (_Check::LeftDateIsBigger(Trade->BeginDate, Trade->EndDate)) continue;
		break;
	}
	return Trade;
}